tap "homebrew/bundle"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "xz"
brew "apache-spark"
brew "bat"
brew "bzip2"
brew "openssl@3"
brew "unbound"
brew "qemu"
brew "lima"
brew "colima", restart_service: true
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gcc@11"
brew "go"
brew "htop"
brew "lapack"
brew "mas" if OS.mac?
brew "nmap"
brew "openblas"
brew "openjdk@11"
brew "openssl@1.1"
brew "powerlevel10k"
brew "readline"
brew "pyenv"
brew "pyenv-virtualenv"
brew "memcached"
brew "ripgrep"
brew "scala"
brew "tcl-tk"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "java"
brew "poetry"
brew "enchant"
cask "1password"  
cask "1password-cli"
cask "macvim"
cask "notunes"
cask "sublime-text" if OS.mac?
cask "sublime-merge" if OS.mac?
cask "raycast"
cask "whatsapp"
cask "spotify"
cask "zoom"
cask "postman"
cask "jetbrains-toolbox" if OS.mac?
cask "nordvpn" if OS.mac?
cask "dash" if OS.mac?
cask "vlc"
cask "warp" if OS.mac?
mas "Amphetamine", id: 937984704
mas "Seashore", id: 1448648921
mas "Boop", id: 1518425043
