tap "homebrew/bundle"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "xz"
brew "apache-spark"
brew "bat"
brew "bzip2"
brew "openssl@3"
brew "unbound"
brew "qemu"
brew "lima"
brew "colima", restart_service: true
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gcc@11"
brew "go"
brew "htop"
brew "lapack"
brew "nmap"
brew "openblas"
brew "openjdk@11"
brew "openssl@1.1"
brew "powerlevel10k"
brew "readline"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "scala"
brew "tcl-tk"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password-cli"
cask "macvim"
cask "notunes"
cask "sublime-text"
