brew "xz"
brew "apache-spark"
brew "bat"
brew "bzip2"
brew "openssl@3"
brew "unbound"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gcc@11"
brew "go"
brew "htop"
brew "lapack"
brew "mas" if OS.mac?
brew "nmap"
brew "node"
brew "nodenv"
brew "openblas"
brew "openjdk@11"
brew "powerlevel10k"
brew "readline"
brew "pyenv"
brew "pyenv-virtualenv"
brew "memcached"
brew "ripgrep"
brew "scala"
brew "tcl-tk"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "java"
brew "poetry"
brew "enchant"
brew "ffmpeg"
brew "git-lfs"
brew "rsync"
brew "gh"
brew "mise"
brew "uv"
cask "visual-studio-code"
cask "1password" if OS.mac?
cask "1password-cli"
cask "notunes" if OS.mac?
cask "sublime-text" if OS.mac?
cask "chatgpt" if OS.mac?
cask "sublime-merge" if OS.mac?
cask "unity-hub" if OS.mac?
cask "raycast" if OS.mac?
cask "whatsapp" if OS.mac?
cask "spotify" if OS.mac?
cask "zoom" if OS.mac?
cask "postman" if OS.mac?
cask "jetbrains-toolbox" if OS.mac?
cask "nordvpn" if OS.mac?
cask "dash" if OS.mac?
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Boop", id: 1518425043
mas "Keeper", id: 414781829
mas "Hour", id: 569089415
mas "Infuse", id: 1136220934
mas "Seashore", id: 1448648921
mas "Strflow", id: 6468486339
