# .zsh_plugins.txt
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search


mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/helper
mattmc3/zephyr path:plugins/macos conditional:is-macos


# Oh-my-zsh dependency management
getantidote/use-omz
#ohmyzsh/ohmyzsh path:lib
#ohmyzsh/ohmyzsh path:plugins/macos conditional:is-macos
ohmyzsh/ohmyzsh path:plugins/sudo kind:defer
#ohmyzsh/ohmyzsh path:plugins/asdf kind:defer
#ohmyzsh/ohmyzsh path:custom/plugins/fzf-tab kind:defer
ohmyzsh/ohmyzsh path:plugins/mise kind:defer
ohmyzsh/ohmyzsh path:plugins/pip kind:defer
#ohmyzsh/ohmyzsh path:plugins/golang kind:defer
#ohmyzsh/ohmyzsh path:plugins/git kind:defer
ohmyzsh/ohmyzsh path:custom/plugins/you-should-use kind:defer
ohmyzsh/ohmyzsh path:plugins/aliases kind:defer
joshskidmore/zsh-fzf-history-search
zsh-hooks/zsh-hooks

mattmc3/zfunctions
zdharma-continuum/fast-syntax-highlighting kind:defer

#romkatv/zsh-bench kind:path
