# .zsh_plugins.txt
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search


mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/helper
mattmc3/zephyr path:plugins/macos conditional:is-macos


# Oh-my-zsh dependency management
getantidote/use-omz
#ohmyzsh/ohmyzsh path:lib
#ohmyzsh/ohmyzsh path:plugins/macos conditional:is-macos
ohmyzsh/ohmyzsh path:plugins/sudo
#ohmyzsh/ohmyzsh path:plugins/asdf
#ohmyzsh/ohmyzsh path:custom/plugins/fzf-tab
ohmyzsh/ohmyzsh path:plugins/mise
ohmyzsh/ohmyzsh path:plugins/pip
#ohmyzsh/ohmyzsh path:plugins/golang
#ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:custom/plugins/you-should-use
ohmyzsh/ohmyzsh path:plugins/aliases
joshskidmore/zsh-fzf-history-search
zsh-hooks/zsh-hooks

mattmc3/zfunctions
zdharma-continuum/fast-syntax-highlighting

#romkatv/zsh-bench kind:path
